# phoneDict = dict([
#     (".", "1"),    (",", "11"),  ("?", "111"), ("!", "1111"), (":", "11111"),
#     ("A", "2"),    ("B", "22"),  ("C", "222"),
#     ("D", "3"),    ("E", "33"),  ("F", "333"),
#     ("G", "4"),    ("H", "44"),  ("I", "444"),
#     ("J", "5"),    ("K", "55"),  ("L", "555"), 
#     ("M", "6"),    ("N", "66"),  ("O", "666"),
#     ("P", "7"),    ("Q", "77"),  ("R", "777"), ("S", "7777"), 
#     ("T", "8"),    ("U", "88"),  ("V", "888"),
#     ("W", "9"),   ("X", "99"),   ("Y", "999"), ("Z", "9999"),
#     (" ", "0")
# ])

# text = input("Enter your text: ")

# for i in range(len(text)):
#     tar=text[i].upper() # tar mi hatik
#     print(phoneDict[tar], end ='')




# phoneDict = dict([
#     ("1", ".----"),    ("A", ".-"),                   ("R", ".-."),
#     ("2", "..---"),    ("B", "-..."),  ("J", ".---"), ("S" , '...'),
#     ("3", "...--"),    ("C", "-.-."),  ("K", "-.-"),  ("T" , '-'),
#     ("4", "...."),    ("D", "-.."),  ("L", ".-.."),    ('U' , '..-'),
#     ("5", "....."),    ("E", "."),  ("M", "--"),       ('V' , '...-'),
#     ("6", "-...."),    ("F", "..-."),  ("N", "-."),    ('W' , '.--'),
#     ("7", "--..."),    ("G", "--."),  ("O", "---"),     ('X' , '-..-'),
#     ("8", "---.."),    ("H", "...."),  ("P", ".--."),    ('Y' , '-.--'),
#     ("9", "----."),   ("I", ".."),   ("Q", "--.-"),     ("Z" , '--..'), 
#     ("0", "----")                                         
# ])


# text = input("Enter your text: ")

# for i in range(len(text)):
#      tar=text[i].upper() 
#      print(phoneDict[tar], end ='')



# phoneDict = dict([
#     ("A", "Ньюфаундленд"),                
#     ("B", "Новая Шотландия"),             ("M", "Онтарио"),    ("Y" , 'Юкон'),
#     ("C", "Остров Принца Эдуарда"),       ("N", "Онтарио"),  
#     ("F", "Нью-Брансуик"),                ("P", "Онтарио"),    
#     ("G", "Квебек"),                      ("R", "Манитоба"),       
#     ("H", "Квебек"),                      ("S", "Саскачеван "),    
#     ("J", "Квебек"),                      ("T", "Альберта"),     
#     ("K", "Онтарио"),                     ("V", "Британская Колумбия"),   
#     ("L", "Онтарио"),                     ("X", "Нунавут"),      
#                                           ("X", "Северо-Западные территории")  
# ])
# text = input("Enter your text: ")

# for i in range(len(text)):
#     tar=text[i].upper() 
#     print(phoneDict[tar], end ='')



# phoneDict = dict([
#     ('A', 1),
#     ('E', 1),
#     ('I', 1),
#     ('L', 1),
#     ('N', 1),
#     ('O', 1),
#     ('R', 1),
#     ('S', 1),
#     ('T', 1),
#     ('U', 1),
#     ('D', 2),
#     ('G', 2),
#     ('B', 3),
#     ('C', 3),
#     ('M', 3),
#     ('P', 3),
#     ('F', 4),
#     ('H', 4),
#     ('V', 4),
#     ('W', 4),
#     ('Y', 4),
#     ('K', 5),
#     ('J', 8),
#     ('X', 8),
#     ('Q', 10),
#     ('Z', 10)
# ])

# count = 0
# text = input('enter text: ')
# for i in range(len(text)):
#     count += phoneDict[text[i].upper()]
#     print(count)

